Revit 2027 API
ValueAtPoint(IList<Double>) Constructor
 Creates object from an array of values
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ValueAtPoint(
	IList<double> values
)
Public Sub New (
	values As IList(Of Double)
)
public:
ValueAtPoint(
	IList<double>^ values
)
new :
        values : IList<float> -> ValueAtPoint
Parameters
values IList<Double>
 Array of values, each corresponding to "measurement"
Exceptions
Exception | Condition
ArgumentException |  Thrown when supplied values contain invalid (infinite or non-number) doubles
ArgumentNullException |  A non-optional argument was null
See Also
Reference
ValueAtPoint Class
ValueAtPoint Overload
Autodesk.Revit.DB.Analysis Namespace